app/controllers/teachers/books_controller.rb

    def index
      @books = current_college.books.order(:name)
---
SELECT "books".* FROM "books" WHERE "books"."college_id" = $1 ORDER BY "books"."name" ASC  [["college_id", 136]]

    def create
      @book = current_college.books.new(book_params)
      if @book.save
---
INSERT INTO "books" ("college_id", "name", "author", "isbn", "total_copies", "available_copies", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"