app/controllers/teachers/exams_controller.rb

SELECT "exams".* FROM "exams" WHERE "exams"."college_id" = $1 AND "exams"."course_id" = $2 ORDER BY "exams"."scheduled_at" DESC  [["college_id", 136], ["course_id", 1521]]
---
    def index
      @exams = current_college.exams
                              .where(course_id: @profile.course_id)
                              .includes(:course)
                              .order(scheduled_at: :desc)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1  [["id", 1521]]
---
    def set_exam
      @exam = current_college.exams
                             .where(course_id: @profile.course_id)
                             .find_by(slug: params[:slug])

      return if @exam.present?