app/controllers/application_controller.rb

  def set_current_college
    @current_college = if params[:college_slug] == current_user.college.slug
                         College.find_by(slug: params[:college_slug])
                       elsif params[:session_slug] == current_user.college.slug
                         College.find_by(slug: params[:session_slug])
                       else
                         current_user.college
                       end
    return if @current_college.present?
---
SELECT "colleges".* FROM "colleges" WHERE "colleges"."slug" = $1 LIMIT $2  [["slug", "whole-freckle"], ["LIMIT", 1]]
SELECT "colleges".* FROM "colleges" ORDER BY "colleges"."id" ASC LIMIT $1  [["LIMIT", 1]]