app/controllers/departments_controller.rb

  def create
    @department = current_college.departments.new(department_params)
    if @department.save
---
INSERT INTO "departments" ("college_id", "head_id", "name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["college_id", 1], ["head_id", 8], ["name", "BSc IT3"], ["slug", "bsc-it3"], ["created_at", "2025-03-14 14:53:40.562908"], ["updated_at", "2025-03-14 14:53:40.562908"]]

  def set_department
    @department = current_college.departments.find_by(slug: params[:slug])
    return if @department.present?
---
SELECT "departments".* FROM "departments" WHERE "departments"."college_id" = $1  [["college_id", 1]]
SELECT 1 AS one FROM "departments" WHERE "departments"."slug" = $1 AND "departments"."id" IS NOT NULL LIMIT $2  [["slug", "bsc-it3"], ["LIMIT", 1]]