app/controllers/fee_types_controller.rb

SELECT "fee_types".* FROM "fee_types" WHERE "fee_types"."college_id" = $1  [["college_id", 1]]
---
  def set_fee_type
    @fee_type = current_college.fee_types.find_by(slug: params[:slug])
    return if @fee_type.present?