app/controllers/setup_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."user_id" = $1 LIMIT $2  [["user_id", 26], ["LIMIT", 1]]
---
  def setup
    if current_user.teacher?
      # Check if the user already has an existing teacher profile
      @existing_teacher = current_user.teacher

      # If no existing teacher profile, create a new one
      if @existing_teacher.nil?
        @teacher = current_user.build_teacher
      else
        @teacher = @existing_teacher
      end

      redirect_to authenticated_user_path if @existing_teacher.present?