app/controllers/users_controller.rb

INSERT INTO "users" ("college_id", "email", "encrypted_password", "name", "role", "contact_no", "description", "slug", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "failed_attempts", "unlock_token", "locked_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"
---
  def create
    @user = current_college.users.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."college_id" = $1  [["college_id", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."slug" = $1 AND "users"."id" IS NOT NULL LIMIT $2  [["slug", "jay"], ["LIMIT", 1]]
---
  def set_user
    @user = current_college.users.find_by(slug: params[:slug])
    return if @user.present?