app/controllers/users/sessions_controller.rb

    def create
      resource = User.find_for_database_authentication(
        email: user_params[:email]
      )
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "jay@softices.in"], ["LIMIT", 1]]