app/views/users/registrations/new.html.haml

        %label.form-label.required{ for: 'username' }= t('devise.registrations.company_name')
        = select_tag :college_id, options_for_select(College.all.map { |college| [college.name, college.id] }, params[:college_id]),
          class: 'form-control', required: true, prompt: 'Select your company name'
---
SELECT "colleges".* FROM "colleges"